Repository: aagedal/Aagedal-Media-Converter
Catalog: Aagedal VideoLoop Converter/Resources/Localizable.xcstrings
Source language: en
Languages: nb

source: Aagedal VideoLoop Converter
nb: Aagedal VideoLoop Konverterer

source: About Aagedal VideoLoop Converter
nb: Om Aagedal VideoLoop Konverterer

source: Add ${video} to the encode queue
nb: Legg til ${video} i konverteringslisten

# Add a comment (single line)...
source: Add a comment to metadata (single line)…
nb: Legg til en kommentar i metadata (en linje)…

source: Add files to begin conversion
nb: Legg til filer for å starte konverteringen

source: Add the selected video file to the Aagedal VideoLoop Converter queue.
nb: Legg til den valgte videofilen i Aagedal VideoLoop Converter køen.

source: Add the selected video file to the queue, set the output folder to the same directory, and start conversion.
nb: Legg til den valgte videofilen til konverteringskøen, og sett lagringsmappa til samme mappe som original-filen, og start konvertering.

source: Add to Encode Queue
nb: Legg til i konverteringskøen

source: Application Settings
nb: Applikasjonsinnstillinger

source: Cancel all conversions
nb: Avbryt alle konverteringer

source: Cancel conversion
nb: Avbryt konvertering

source: Cannot delete while converting
nb: Kan ikke slette mens filen konverterer

source: Change default output folder
nb: Endre standard mappe for eksport.

source: Clear
nb: Rens listen

source: Close
nb: Lukk

source: Convert ${video} immediately
nb: Konverter ${video} øyeblikkelig.

source: Convert Video Immediately
nb: Konverter video øyeblikkelig

source: Custom Preset
nb: Selvjusterbar forhåndsinnstilling

source: Date tag
nb: Dato-tagg

source: Date tag is an autogenerated text that is added to the start of metadata field 'Comment'. E.g.: 'Date generated: 20250925'. If turned on, the date tag comes before the text written in the comment field on the video card.
nb: Dato-tagg er en auto-generert tekst som legges til i starten av metadata-feltet ‘Comment’. Eks.: Date Generated: 20250925’. Hvis skrudd på så vil dato-taggen legge seg før kommentar-teksten som du kan skrive inn på video-kortet.

source: Default Output Folder
nb: Standard eksport mappe

source: Delete from list
nb: Slett fra listen

source: Developer Website
nb: Utviklerens nettside

source: Done
nb: Ferdig

source: Drag and drop video files here
nb: Dra og slipp videofiler her

source: Duration exceeds 15 seconds. VideoLoops are best suited for shorter videos.
nb: Varighet er lengre enn 15-sekunder. VideoLooper fungerer best med kortere videosnutter.

source: Duration: %@
nb: Varighet: %@

# Example: `-c:v libx264 -crf 18 -preset slow -c:a copy` produces `filename%@.%@`.
source: Example: `-c:v libx264 -crf 18 -preset slow -c:a copy` produces `filename%1$@.%2$@`.
nb: Eksempel: `-c:v libx264 -crf 18 -preset slow -c:a copy` lager `filename%1$@.%2$@`.

source: FFMPEG frontend with focus on creating videoloops: Small .mp4-files that are intended to replace GIFs on modern websites.
nb: Brukergrensesnitt for FFMPEG med fokus på å lage videolooper: Små .mp4-filer er ment å erstatte GIF-er på moderne nettsider.

source: GitHub Project
nb: GitHub prosjektet

source: Import
nb: Importer

source: Import video files
nb: Importer videofiler

source: Import…
nb: Importer…

source: Include date tag
nb: Inkluder dato-tagg

source: Include date tag on new files
nb: Inkluder dato-tagg på nye filer

source: Input Size %@
nb: Input størrelse %@

source: No files ready to convert.
nb: Ingen filer klare til å bli konvertert.

# or double-click to import files
source: or double click to import
nb: eller dobbel-klikk for å importere

source: Output
nb: Eksport mappe

source: Output extension
nb: Filetternavn på eksport

source: Output file already exists. Click to show in Finder.
nb: En fil med dette navnet eksisterer allerede. Klikk for å vise i Finder.

source: Output file suffix
nb: Suffix på export

source: Output Folder
nb: Lagringsmappe

source: Overall Progress %lld%%
nb: Total fremdrift: %lld%%

source: Preset
nb: Forhåndsinnstilling

source: Preset Information
nb: Informasjon om forhåndsinnstillinger

# PRESET_ANIMATED_AVIF_DESCRIPTION
source: File extension: .avif | A modern, highly efficient image format with animation support. Uses AV1 codec for compression, specifically the svtav1 encoder. Automatically deinterlaces if needed using yadif=3. Limits resolution to 720 pixels on short end.
nb: Filendelse: .avif | Moderne, svært effektivt bildeformat med animasjonsstøtte. Bruker AV1-kodek for komprimering, spesifikt svtav1-enkoderen. Oppløsningen er begrenset til 720 piksler på kortsiden.

# PRESET_AUDIO_AAC_STEREO_DESCRIPTION
source: Audio only stereo down mix AAC-file.
nb: Bare lyd. Stereo nedmiks AAC-fil.

# PRESET_AUDIO_WAV_DESCRIPTION
source: Audio only uncompressed WAV, keeping all audio channels if possible.
nb: Bare lyd. Ukomprimert WAV, beholder alle lydkanaler hvis mulig.

# PRESET_CUSTOM_DESCRIPTION
source: Custom FFMPEG preset. You do not need to write ffmpeg or input parameters. Only the output parameters.
nb: Personlig forhåndsinnstilling. Du trenger ikke skrive ‘ffmpeg’ eller input-parametre. Kun enkoder-parametre.

# PRESET_HEVC_PROXY_DESCRIPTION
source: Proxy format based on HEVC codec. 10-bit 6 Mbps. Retains all audio channels as uncompressed PCM.
nb: Proxy-format basert på HEVC (.h265) kodeken. 10-bit 6 Mbps. Beholder alle lydkanaler som ukomprimert PCM-lyd.

# PRESET_PRORES_DESCRIPTION
source: Apple ProRes (yuv422p10) for edit-friendly masters. Includes the first video and audio streams, retains 24-bit PCM audio, and targets standard ProRes bitrates.
nb: Apple ProRes (yuv422p10) for redigeringsklare mastere. Inkluderer første video- og lydspor, beholder 24-bit PCM-lyd og sikter mot standard ProRes-bithastigheter.

# PRESET_TV_QUALITY_4K_DESCRIPTION
source: Broadcast 4K delivery. Hardware HEVC (10-bit 4:2:2) targets 60 Mbps, preserves all audio as 24-bit PCM, and limits the shortest edge to 2160 px.
nb: 4K-leveranse for TV. Maskinvareakselerert HEVC (10-bit 4:2:2) sikter mot 60 Mbps, beholder all lyd som 24-bit PCM og begrenser korteste kant til 2160 piksler.

# PRESET_TV_QUALITY_HD_DESCRIPTION
source: Broadcast-ready 1080p. Hardware HEVC (10-bit 4:2:2) targets 18 Mbps and keeps every audio channel as 24-bit PCM. Shortest edge limited to 1080 px.
nb: Sendeklar 1080p. Maskinvareakselerert HEVC (10-bit 4:2:2) sikter mot 18 Mbps og beholder alle lydkanaler som 24-bit PCM. Korteste kant begrenses til 1080 piksler.

# PRESET_VIDEO_LOOP_DESCRIPTION
source: Optimized for seamless silent loops. Encodes with x264 at CRF 23 (3–9 Mbps variable bitrate), strips audio, and limits the shortest edge to 1080 px for web playback.
nb: Optimalisert for sømløse, stille looper. Koder med x264 på CRF 23 (3–9 Mbps variabel bithastighet), fjerner lyd og begrenser korteste kant til 1080 piksler for web-avspilling.

# PRESET_VIDEO_LOOP_WITH_AUDIO_DESCRIPTION
source: Seamless loops that retain audio. Encodes video with x264 at CRF 23 (3–9 Mbps), mixes the first audio track to stereo if needed, and stores audio as 192 kbps AAC while limiting the shortest edge to 1080 px.
nb: Sømløse looper med lyd. Koder video med x264 på CRF 23 (3–9 Mbps), mikser første lydspor til stereo ved behov og lagrer lyden som 192 kbps AAC, samtidig som korteste kant begrenses til 1080 piksler.

source: Remove all files from the list
nb: Fjern alle filer fra listen

source: Remove from list
nb: Fjern fra listen

# Reset conversion
source: Reset conversion status
nb: Nullstill konverteringsstatus

source: Select export preset for all files
nb: Velg eksportpreset for alle filer

source: Select output folder
nb: Velg eksport mappe

source: Show in Finder
nb: Vis i Finder

source: Specify the arguments passed to ffmpeg (without including the `ffmpeg` command itself).
nb: Spesifiser argumentene som du vil sende til FFMPEG (uten å inkludere ‘ffmpeg’ commanden i seg selv).

source: Start converting all files
nb: Start konvertering av alle filer

# Version %@ (%@)
source: Version %1$@ (%2$@)
nb: Versjon %1$@ (%2$@)

source: Video File
nb: Videofil
